/*
تاريخ الميلاد
5 نقاط لكل لغة
سهل
وصف التحدي
قم بكتابة دالة function تستقبل تاريخ ووقت على شكل قيمة نصية string. تقوم الدالة باللتحقق ما إن كان التاريخ المُدخل تاريخ عُمر صحيح أم لا. بحيث تقوم الداله بإرجاع القيمة True في حال كان التاريخ المُدخل تاريخاً صحيحاً وتقوم بإرجاع القيمة False في حال كان التاريخ المُدخل غير صحيح وذلك حسب الشروط التالية:

١. أن يكون التاريخ المدخل قبل تاريخ اليوم الحالي

٢. أن يكون التاريخ المدخل قبل ٤ أعوام كحد أدنى من تاريخ اليوم الحالي

٣. أن يكون التاريخ المدخل لا يتجاوز 200 عام في الماضي عن التاريخ الحالي

المخرجات المتوقعة
الاختبار 1

المدخلات (Inputs)
dateString = '2099-08-02T00:00:00'
المخرجات (Outputs)
false
الاختبار 2

المدخلات (Inputs)
dateString = '2017-10-21T00:00:00'
المخرجات (Outputs)
true
الاختبار 3

المدخلات (Inputs)
dateString = '1111-08-29T00:00:00'
المخرجات (Outputs)
false
الاختبار 4

المدخلات (Inputs)
dateString = '3020-01-01T00:00:00'
المخرجات (Outputs)
false
*/

package main

import (
	"fmt"
	"strconv"
)

func main() {
	fmt.Println(date("2099-08-02T00:00:00"))
	fmt.Println(date("2017-10-21T00:00:00"))
	fmt.Println(date("1111-08-29T00:00:00"))
	fmt.Println(date("1823-10-21T00:00:00"))

	fmt.Println(date("3020-01-01T00:00:00"))
}

func date(s string) bool {
	year, _ := strconv.Atoi(s[:4])
	thisY := 2023
	if year <= thisY-4 && year >= thisY-200 {
		return true
	}
	return false
}
